config/gptel/diagnostics.org
#+title: GPTEL Diagnostics
#+property: header-args:emacs-lisp :tangle diagnostics.el
#+auto_tangle: y

* Overview

This module provides diagnostic tools for debugging GPTEL session restoration issues,
particularly focusing on tool call serialization problems.

** Problem Statement

*Tool calls are not correctly restored when reopening a gptel session.*

After saving and closing a gptel session that contains tool calls, reopening the
session.md file and sending a new prompt results in an API error:

#+begin_example
Claude error: ((HTTP/2 400) invalid_request_error)
messages.1.content.0.tool_use.name: Input should be a valid string
#+end_example

The tool data is serialized as ="name": {}= and ="input": {}= instead of the actual
tool name and arguments, causing the API request to fail.

** Problem Context

When restoring a gptel session from =session.md=, tool calls fail to serialize correctly:
- Tool data shows as ="name": {}= and ="input": {}= instead of actual values
- The =gptel--bounds= variable changes after sending a prompt
- Initial bounds: =((tool (81 1347 "toolu_...")) ...)=
- After send: =((tool (38 1347 "toolu_...")) ...)= ← Position shifted
- When =gptel--parse-buffer= tries =(read (current-buffer))= at wrong position, it fails to read the tool-call sexp

** Root Cause Hypothesis

The tool property bound starts at the wrong buffer position (37 instead of 80),
causing =gptel--parse-buffer= to read from blank space instead of the tool call sexp.

** Findings

*** Root Cause: =gptel--inherit-stickiness= Interference

The bug is an *upstream gptel issue* in =gptel--inherit-stickiness= (gptel.el:698-706), which interferes
with property restoration.

*** How the Bug Happens

During =gptel--restore-props=, properties are restored in this order:

1. ✓ =add-text-properties(80 1346 tool)= - Sets tool property at position 80-1346
2. =add-text-properties(37 80 ignore)= - Attempts to set ignore property at 37-80
   - This triggers =after-change-functions= hook
   - =gptel--inherit-stickiness(37 80 43)= is called
   - It checks position 80 (END parameter) with =(get-text-property end 'gptel)=
   - Finds =(tool . "toolu_...")= already there from step 1!
   - Copies tool property to 37-80: =(add-text-properties beg end `(gptel ,val ...)=
   - ✗ *This overwrites the ignore property we just set!*
3. ✓ =add-text-properties(1346 1351 ignore)= - Sets ignore (no adjacent tool property)
4. ✓ =add-text-properties(1351 2903 response)= - Sets response
5. ✓ =add-text-properties(2917 2971 response)= - Sets response

Result: Position 37 has =tool= property instead of =ignore=, causing tool call parsing to fail.

*** Why It Happens

=gptel--inherit-stickiness= is designed to make text properties "sticky" during normal editing - when you
type adjacent to a response region, the new text inherits the same property. However, it should NOT be
active during restoration.

The function blindly copies whatever =gptel= property exists at position END to the entire BEG-END range,
without considering:
- Whether restoration is in progress
- Whether the adjacent property is compatible (tool vs ignore)
- Whether this overwrites an intentional property assignment

*** The Fix

*Upstream fix needed in gptel.el:* =gptel--restore-props= should temporarily remove
the =gptel--inherit-stickiness= hook during restoration to prevent interference.

**Original fix (TOO AGGRESSIVE):**
#+begin_src emacs-lisp
(defun gptel--restore-props (bounds-alist)
  "Restore text properties from BOUNDS-ALIST."
  (let ((modified (buffer-modified-p))
        (inhibit-modification-hooks t))  ; <-- Disables ALL modification hooks
    ;; ... existing restoration code ...
    (set-buffer-modified-p modified)))
#+end_src

**Problem:** =inhibit-modification-hooks t= disabled ALL modification hooks, which interfered
with buffer state management. After restoration and sending a new prompt, =gptel--bounds=
would lose all historical tool/ignore properties, keeping only the latest response.

**Improved fix (SURGICAL):**
#+begin_src emacs-lisp
(defun gptel--restore-props (bounds-alist)
  "Restore text properties from BOUNDS-ALIST."
  (let ((modified (buffer-modified-p))
        (had-inherit-hook (memq 'gptel--inherit-stickiness after-change-functions)))
    ;; Temporarily remove gptel--inherit-stickiness to prevent interference
    (remove-hook 'after-change-functions 'gptel--inherit-stickiness t)
    ;; ... existing restoration code ...
    ;; Restore the hook if it was present
    (when had-inherit-hook
      (add-hook 'after-change-functions 'gptel--inherit-stickiness nil t))
    (set-buffer-modified-p modified)))
#+end_src

**Why this is better:**
- Only disables the specific problematic hook
- Other modification hooks continue to work normally
- Text property machinery works correctly
- Buffer state is preserved across multiple save/restore cycles
- Hook is properly restored after property restoration completes

*Status:* Improved fix has been applied to local gptel installation at
=runtime/straight/repos/gptel/gptel.el:596-624=.

The change has been committed in the gptel repository with a detailed commit message
explaining the bug mechanism and fix. The patch will persist until gptel is rebuilt
or updated via straight.el.

To verify the fix is working:
1. Copy an uncorrupted session: =cp -r test-20260126142209 test-verify-fix=
2. Restart Emacs to load patched gptel
3. Open session.md and send a prompt
4. Check Local Variables show correct bounds: =(tool (80 1346 ...)) (ignore (37 80) ...)=
5. Diagnostic logs should show only 5 =add-text-properties= calls, not 6

*** Diagnostic Evidence

Full backtrace from test-restore-2 session shows:

#+begin_example
145:  add-text-properties(37 80 (gptel ignore))           ; gptel--restore-props call
144:  apply(#<subr add-text-properties> (37 80 (gptel ignore)))
143:  #<subr add-text-properties>(37 80 (gptel ignore) nil)
142:  gptel--inherit-stickiness(37 80 43)                 ; after-change-functions triggered
141:  add-text-properties(37 80 (gptel (tool . "toolu_..."))) ; overwrites ignore!
#+end_example

The backtrace confirms =gptel--inherit-stickiness= is called via =after-change-functions= and
overwrites the property being restored.

** Testing Methodology

To test session restoration without side effects, we copy an existing session directory to a new location before opening it:

#+begin_example
cp -r ~/.gptel/sessions/test-20260126142209 ~/.gptel/sessions/test-restore-N
#+end_example

This allows:
- Opening the copied session.md multiple times without corrupting the original
- Testing restoration behavior in isolation
- Comparing saved bounds vs restored bounds

** Test Session Details

Session =test-20260126142209= used for debugging has these characteristics:

- Tool call: =read_file= with filepath "~/Brewfile"
- Tool ID: ="toolu_01BUV8b8HrXnk2tVUKdZoBLj"=
- Saved bounds structure:
  #+begin_src elisp
  ((tool (80 1346 "toolu_01BUV8b8HrXnk2tVUKdZoBLj"))
   (ignore (37 80) (1346 1351))
   (response (1351 2903) (2917 2971)))
  #+end_src

- Position 37: Start of markdown code fence =``` tool=
- Position 80: Start of tool-call sexp =(:name "read_file" ...)=
- Position 1346: End of tool result
- Position 1351: End of closing code fence

The bug manifested as position 37 getting the =tool= property instead of =ignore= after restoration.

* Diagnostic Variables

#+begin_src emacs-lisp
(defvar jf/gptel--bounds-history nil
  "History of gptel--bounds changes for debugging.")

(defvar jf/gptel--parse-trace nil
  "Trace of tool parsing attempts.")

(defvar jf/gptel--diagnostic-file nil
  "Current diagnostic log file path. Auto-set to session dir or fallback.")

(defvar jf/gptel--diagnostic-fallback-file
  (expand-file-name "~/.gptel-diagnostics.log")
  "Fallback diagnostic file when not in a session.")
#+end_src

* Auto-Write Diagnostic Data

Automatically write diagnostic data to a file after each event.

#+begin_src emacs-lisp
(defun jf/gptel--get-diagnostic-file ()
  "Get the current diagnostic file path.
Uses session directory if in a gptel session, otherwise fallback."
  (or jf/gptel--diagnostic-file
      (setq jf/gptel--diagnostic-file
            (if (and (boundp 'jf/gptel--current-session-id)
                     jf/gptel--current-session-id)
                ;; We're in a session - write to session directory
                (expand-file-name "diagnostics.log"
                                 (expand-file-name
                                  jf/gptel--current-session-id
                                  jf/gptel-session-root-dir))
              ;; Not in a session - use fallback
              jf/gptel--diagnostic-fallback-file))))

(defun jf/gptel--write-diagnostic-entry (entry)
  "Write diagnostic ENTRY to the auto-log file immediately."
  (let ((log-file (jf/gptel--get-diagnostic-file))
        (timestamp (format-time-string "%Y-%m-%d %H:%M:%S.%3N")))
    (with-temp-buffer
      (insert (format "\n=== %s | %s ===\n"
                     timestamp
                     (plist-get entry :phase)))
      (insert (format "Buffer: %s\n" (plist-get entry :buffer)))
      (insert (format "Bounds: %S\n" (plist-get entry :bounds)))

      ;; If tool parses were captured, show them
      (when-let ((tool-parses (plist-get entry :tool-parses)))
        (insert "\nTool Parse Results:\n")
        (dolist (parse tool-parses)
          (if (plist-get parse :success)
              (insert (format "  ✓ Position %d: %s\n"
                             (plist-get parse :position)
                             (plist-get parse :name)))
            (insert (format "  ✗ Position %d: ERROR - %s\n"
                           (plist-get parse :position)
                           (plist-get parse :error))))))

      (insert "\n")

      ;; Append to file
      (append-to-file (point-min) (point-max) log-file))))

(defun jf/gptel--write-parse-entry (entry)
  "Write parse trace ENTRY to the auto-log file immediately."
  (let ((log-file (jf/gptel--get-diagnostic-file))
        (timestamp (format-time-string "%Y-%m-%d %H:%M:%S.%3N")))
    (with-temp-buffer
      (insert (format "\n=== %s | PARSE-BUFFER ===\n" timestamp))
      (insert (format "Buffer: %s\n" (plist-get entry :buffer)))
      (insert (format "API results: %d\n" (plist-get entry :num-results)))

      ;; Show tool scans
      (when-let ((tool-scans (plist-get entry :tool-scans)))
        (insert (format "Tool positions found: %d\n\n" (length tool-scans)))
        (dolist (scan tool-scans)
          (if (plist-get scan :success)
              (insert (format "  ✓ Position %d (line %d): %s\n"
                             (plist-get scan :position)
                             (plist-get scan :line)
                             (plist-get scan :name)))
            (insert (format "  ✗ Position %d (line %d): ERROR - %s\n"
                           (plist-get scan :position)
                           (plist-get scan :line)
                           (plist-get scan :error))))))

      (insert "\n")

      ;; Append to file
      (append-to-file (point-min) (point-max) log-file))))
#+end_src

