config/gptel/diagnostics.el

(defun jf/gptel--record-bounds (phase &optional extra-info)
  "Record current gptel--bounds value with PHASE label.
EXTRA-INFO can provide additional context about the recording.
Also captures what's actually at tool positions and what would be parsed."
  (when (boundp 'gptel--bounds)
    (let* ((timestamp (format-time-string "%H:%M:%S.%3N"))
           (bounds-value (if (local-variable-p 'gptel--bounds)
                            gptel--bounds
                          'not-buffer-local))
           (tool-parses nil)
           (entry (list :timestamp timestamp
                       :phase phase
                       :bounds bounds-value
                       :buffer (buffer-name)
                       :extra extra-info)))

      ;; For each tool bound, capture what would be parsed
      (when (and (listp bounds-value)
                 (not (eq bounds-value 'not-buffer-local)))
        (when-let ((tool-bounds (alist-get 'tool bounds-value)))
          (dolist (bound tool-bounds)
            (let* ((beg (nth 0 bound))
                   (end (nth 1 bound))
                   (id (nth 2 bound))
                   (parse-result nil))
              (save-excursion
                (goto-char beg)
                (setq parse-result
                      (condition-case err
                          (let* ((tool-call (read (current-buffer)))
                                 (name (plist-get tool-call :name))
                                 (args (plist-get tool-call :args)))
                            (list :success t
                                  :id id
                                  :position beg
                                  :name name
                                  :args args
                                  :full-sexp tool-call))
                        (error
                         (list :success nil
                               :id id
                               :position beg
                               :error (error-message-string err)
                               :buffer-content (buffer-substring-no-properties
                                               beg (min end (+ beg 100))))))))
              (push parse-result tool-parses)))))

      (when tool-parses
        (plist-put entry :tool-parses (nreverse tool-parses)))

      (push entry jf/gptel--bounds-history)

      ;; Auto-write to diagnostic file
      (jf/gptel--write-diagnostic-entry entry)

      (message "[BOUNDS] %s: %s (tools: %d)" phase bounds-value (length tool-parses)))))

(defun jf/gptel--inspect-bounds-positions ()
  "Show buffer content at positions specified in gptel--bounds."
  (interactive)
  (unless (and (boundp 'gptel--bounds) gptel--bounds)
    (user-error "No gptel--bounds in current buffer"))

  (with-output-to-temp-buffer "*GPTEL Bounds Inspection*"
    (princ (format "Buffer: %s\n" (buffer-name)))
    (princ (format "gptel--bounds: %S\n\n" gptel--bounds))

    (dolist (prop-entry gptel--bounds)
      (let ((prop-type (car prop-entry))
            (bounds-list (cdr prop-entry)))
        (princ (format "=== Property: %s ===\n" prop-type))

        (dolist (bound bounds-list)
          (let* ((beg (nth 0 bound))
                 (end (nth 1 bound))
                 (val (nth 2 bound))
                 (text-prop (get-text-property beg 'gptel)))
            (princ (format "\nBound: %S\n" bound))
            (princ (format "  Position %d-%d" beg end))
            (when val (princ (format " (value: %s)" val)))
            (princ "\n")
            (princ (format "  Text property at %d: %S\n" beg text-prop))
            (princ (format "  Line at position %d: %d\n"
                          beg (line-number-at-pos beg)))
            (princ (format "  Content preview (50 chars from %d):\n" beg))
            (princ (format "    %S\n"
                          (buffer-substring-no-properties
                           beg (min end (+ beg 50)))))

            ;; For tool bounds, show if we can read a valid sexp
            (when (eq prop-type 'tool)
              (princ "  Attempting to read sexp from position:\n")
              (save-excursion
                (goto-char beg)
                (condition-case err
                    (let ((sexp (read (current-buffer))))
                      (princ (format "    SUCCESS: %S\n" sexp)))
                  (error
                   (princ (format "    ERROR: %s\n" err))))))))
        (princ "\n")))))
