config/gptel/diagnostics.el

(defun jf/gptel--scan-tool-positions ()
  "Scan buffer for tool positions and attempt to parse them.
Returns list of parse attempts with results."
  (let ((tool-parses nil)
        (pt (point-max)))
    ;; Scan backwards like gptel--parse-buffer does
    (save-excursion
      (while (> pt (point-min))
        (let ((prop-val (get-char-property pt 'gptel)))
          (when (and (consp prop-val)
                     (eq (car prop-val) 'tool))
            (let* ((tool-id (cdr prop-val))
                   (line (line-number-at-pos pt))
                   (trace-entry (list :type "tool-scan"
                                     :position pt
                                     :line line
                                     :property prop-val
                                     :id tool-id)))
              (goto-char pt)
              (condition-case err
                  (let* ((tool-call (read (current-buffer)))
                         (name (plist-get tool-call :name))
                         (args (plist-get tool-call :args)))
                    (plist-put trace-entry :success t)
                    (plist-put trace-entry :sexp tool-call)
                    (plist-put trace-entry :name name)
                    (plist-put trace-entry :args args))
                (error
                 (plist-put trace-entry :success nil)
                 (plist-put trace-entry :error (error-message-string err))
                 (plist-put trace-entry :buffer-content
                           (buffer-substring-no-properties
                            pt (min (point-max) (+ pt 100))))))
              (push trace-entry tool-parses)))
          (setq pt (previous-single-char-property-change pt 'gptel nil (point-min))))))
    (nreverse tool-parses)))

(defun jf/gptel--trace-parse-buffer-advice (orig-fn backend &optional max-entries)
  "Trace gptel--parse-buffer execution for tool call parsing.
ORIG-FN is the original function, BACKEND is the gptel backend,
MAX-ENTRIES limits the number of entries to parse."
  ;; Capture tool positions BEFORE parsing
  (let* ((pre-parse-scan (jf/gptel--scan-tool-positions))
         (result (funcall orig-fn backend max-entries))
         (parse-entry (list :timestamp (format-time-string "%H:%M:%S.%3N")
                           :phase "parse-buffer-call"
                           :buffer (buffer-name)
                           :num-results (length result)
                           :tool-scans pre-parse-scan)))
    (push parse-entry jf/gptel--parse-trace)

    ;; Auto-write to diagnostic file
    (jf/gptel--write-parse-entry parse-entry)

    ;; Display trace window
    (with-temp-buffer-window "*GPTEL Parse Trace*" nil nil
      (princ (format "=== Parse Buffer Trace ===\n"))
      (princ (format "Buffer: %s\n" (buffer-name)))
      (princ (format "API entries generated: %d\n" (length result)))
      (princ (format "Tool positions found: %d\n\n" (length pre-parse-scan)))

      (dolist (scan pre-parse-scan)
        (princ (format "--- Tool at position %d (line %d) ---\n"
                      (plist-get scan :position)
                      (plist-get scan :line)))
        (princ (format "  ID: %s\n" (plist-get scan :id)))
        (if (plist-get scan :success)
            (progn
              (princ (format "  Name: %s\n" (plist-get scan :name)))
              (princ (format "  Args: %S\n" (plist-get scan :args))))
          (progn
            (princ (format "  ERROR: %s\n" (plist-get scan :error)))
            (when-let ((content (plist-get scan :buffer-content)))
              (princ (format "  Buffer content: %S\n" content)))))
        (princ "\n")))
    result))

(defun jf/gptel--show-all-text-properties ()
  "Display all gptel text properties in current buffer."
  (interactive)
  (let ((pt (point-min)))
    (with-output-to-temp-buffer "*GPTEL Text Properties*"
      (princ (format "=== GPTEL Text Properties in %s ===\n\n" (buffer-name)))

      (while (< pt (point-max))
        (let ((next-change (next-single-property-change pt 'gptel nil (point-max)))
              (prop-value (get-text-property pt 'gptel)))
          (when prop-value
            (let* ((line-start (line-number-at-pos pt))
                   (line-end (line-number-at-pos (or next-change (point-max))))
                   (content (buffer-substring-no-properties
                            pt (min (or next-change (point-max))
                                   (+ pt 60)))))
              (princ (format "Position %d-%s (lines %d-%d)\n"
                            pt (or next-change "END")
                            line-start line-end))
              (princ (format "  Property: %S\n" prop-value))
              (princ (format "  Content: %S%s\n\n"
                            content
                            (if (> (- (or next-change (point-max)) pt) 60)
                                "..." "")))))
          (setq pt (or next-change (point-max))))))))
