config/gptel/diagnostics.org
* Diagnostic 5: Complete Session Lifecycle Management

Single comprehensive system capturing entire test flow.

#+begin_src emacs-lisp
(defun jf/gptel--start-diagnostic-session ()
  "Enable all diagnostics for a test session."
  (interactive)
  (setq jf/gptel--bounds-history nil)
  (setq jf/gptel--parse-trace nil)

  ;; Remove any existing advice first (in case of reload)
  (jf/gptel--stop-diagnostic-session)

  ;; Install all advice
  (advice-add 'gptel--restore-props :before
              (lambda (bounds-alist)
                (jf/gptel--record-bounds "BEFORE-restore-props")
                ;; Log the exact bounds-alist structure
                (let ((log-file (jf/gptel--get-diagnostic-file)))
                  (with-temp-buffer
                    (insert "\n=== BOUNDS-ALIST PASSED TO gptel--restore-props ===\n")
                    (pp bounds-alist (current-buffer))
                    (insert "\n")
                    (append-to-file (point-min) (point-max) log-file)))))

  ;; Trace what add-text-properties is called with during restoration
  (advice-add 'add-text-properties :before
              (lambda (beg end props &optional _)
                (when (and (listp props)
                           (memq 'gptel props)
                           (string-match-p "session\\.md" (or (buffer-file-name) "")))
                  (let ((log-file (jf/gptel--get-diagnostic-file))
                        (gptel-val (plist-get props 'gptel)))
                    (with-temp-buffer
                      (insert (format "add-text-properties called: %d-%d gptel=%S\n"
                                     beg end gptel-val))
                      ;; Capture FULL stack trace to see calling code
                      (insert "  Full Backtrace:\n")
                      (let ((standard-output (current-buffer)))
                        (backtrace))
                      (insert "\n")
                      (append-to-file (point-min) (point-max) log-file)))))
              '((name . gptel-diagnostics)))
  (advice-add 'gptel--restore-props :after
              (lambda (&rest _)
                (jf/gptel--record-bounds "AFTER-restore-props")
                ;; Also scan actual buffer properties to verify restoration
                (let* ((actual-tools (jf/gptel--scan-tool-positions))
                       (log-file (jf/gptel--get-diagnostic-file)))
                  (when actual-tools
                    (message "[BOUNDS] ACTUAL buffer properties after restore: %d tools found"
                             (length actual-tools))
                    ;; Write to log file
                    (with-temp-buffer
                      (insert (format "\n=== ACTUAL BUFFER PROPERTIES (after restore) ===\n"))
                      (insert (format "Found %d tool properties in buffer:\n" (length actual-tools)))
                      (dolist (tool actual-tools)
                        (let* ((pos (plist-get tool :position))
                               (gptel-prop (save-excursion
                                            (with-current-buffer (get-buffer "session.md")
                                              (get-text-property pos 'gptel))))
                               (text-sample (save-excursion
                                             (with-current-buffer (get-buffer "session.md")
                                               (buffer-substring-no-properties
                                                pos (min (point-max) (+ pos 20)))))))
                          (insert (format "  Position %d (line %d): name=%s\n"
                                         pos
                                         (plist-get tool :line)
                                         (or (plist-get tool :name) "nil")))
                          (insert (format "    Property value: %S\n" gptel-prop))
                          (insert (format "    Text at position: %S\n" text-sample))))
                      (insert "\n")
                      (append-to-file (point-min) (point-max) log-file))
                    (dolist (tool actual-tools)
                      (message "[BOUNDS]   Position %d: %s"
                               (plist-get tool :position)
                               (plist-get tool :name)))))))
  (advice-add 'gptel--get-buffer-bounds :around
              (lambda (orig-fn &rest args)
                (jf/gptel--record-bounds "BEFORE-get-buffer-bounds")
                (let ((result (apply orig-fn args)))
                  (jf/gptel--record-bounds "AFTER-get-buffer-bounds"
                                          (list :result result))
                  result)))
  (advice-add 'gptel--save-state :before
              (lambda (&rest _)
                (jf/gptel--record-bounds "BEFORE-save-state")))
  (advice-add 'gptel--save-state :after
              (lambda (&rest _)
                (jf/gptel--record-bounds "AFTER-save-state")))
  (advice-add 'jf/gptel--auto-init-session-buffer :before
              (lambda (&rest _)
                (jf/gptel--record-bounds "BEFORE-auto-init")))
  (advice-add 'jf/gptel--auto-init-session-buffer :after
              (lambda (&rest _)
                (jf/gptel--record-bounds "AFTER-auto-init")))
  (advice-add 'gptel--parse-buffer :around
              #'jf/gptel--trace-parse-buffer-advice)

  (message "Diagnostic session started. Run test flow, then call jf/gptel--dump-diagnostic-report"))
#+end_src

#+begin_src emacs-lisp
(defun jf/gptel--dump-diagnostic-report ()
  "Dump complete diagnostic report to a file."
  (interactive)
  (let ((report-file (expand-file-name
                     (format "gptel-diagnostic-%s.org"
                            (format-time-string "%Y%m%d-%H%M%S"))
                     "~/")))
    (with-temp-file report-file
      (insert "#+TITLE: GPTEL Diagnostic Report\n")
      (insert (format "#+DATE: %s\n\n" (format-time-string "%Y-%m-%d %H:%M:%S")))

      ;; Summary section
      (insert "* Summary\n\n")
      (insert "** Tool Parse Results by Phase\n\n")
      (dolist (entry (reverse jf/gptel--bounds-history))
        (when-let ((tool-parses (plist-get entry :tool-parses)))
          (insert (format "*** %s (%s)\n"
                         (plist-get entry :phase)
                         (plist-get entry :timestamp)))
          (dolist (parse tool-parses)
            (if (plist-get parse :success)
                (insert (format "- ✓ Position %d: ~%s~ with args\n"
                               (plist-get parse :position)
                               (plist-get parse :name)))
              (insert (format "- ✗ Position %d: ERROR - %s\n"
                             (plist-get parse :position)
                             (plist-get parse :error)))))
          (insert "\n")))

      (insert "** Parse Buffer Calls\n\n")
      (dolist (trace (reverse jf/gptel--parse-trace))
        (when (equal (plist-get trace :phase) "parse-buffer-call")
          (insert (format "*** %s - %d tools found\n"
                         (plist-get trace :timestamp)
                         (length (plist-get trace :tool-scans))))
          (dolist (scan (plist-get trace :tool-scans))
            (if (plist-get scan :success)
                (insert (format "- ✓ Position %d: ~%s~\n"
                               (plist-get scan :position)
                               (plist-get scan :name)))
              (insert (format "- ✗ Position %d: %s\n"
                             (plist-get scan :position)
                             (plist-get scan :error)))))
          (insert "\n")))

      ;; Raw data sections
      (insert "* Bounds History (Full Data)\n\n")
      (insert "#+BEGIN_SRC elisp\n")
      (pp jf/gptel--bounds-history (current-buffer))
      (insert "\n#+END_SRC\n\n")

      (insert "* Parse Trace (Full Data)\n\n")
      (insert "#+BEGIN_SRC elisp\n")
      (pp jf/gptel--parse-trace (current-buffer))
      (insert "\n#+END_SRC\n\n")

      (insert "* Current Buffer State\n\n")
      (when (buffer-live-p (get-buffer "session.md"))
        (with-current-buffer "session.md"
          (insert (format "** gptel--bounds\n\n"))
          (insert "#+BEGIN_SRC elisp\n")
          (when (boundp 'gptel--bounds)
            (pp gptel--bounds (current-buffer)))
          (insert "\n#+END_SRC\n\n"))))

    (message "Diagnostic report written to %s" report-file)
    (find-file report-file)))
#+end_src

#+begin_src emacs-lisp
(defun jf/gptel--stop-diagnostic-session ()
  "Disable all diagnostics and clean up.
Removes ALL advice from diagnostic functions, not just specific ones."
  (interactive)
  ;; Remove all advice from these functions
  (dolist (func '(gptel--restore-props
                  gptel--get-buffer-bounds
                  gptel--save-state
                  jf/gptel--auto-init-session-buffer
                  gptel--parse-buffer))
    (advice-mapc (lambda (advice props)
                   (advice-remove func advice))
                 func))

  ;; Remove named advice from add-text-properties
  (advice-remove 'add-text-properties 'gptel-diagnostics)

  (message "Diagnostic session stopped - all advice removed"))
#+end_src

