config/gptel/diagnostics.org
* Usage Instructions

** Starting a Diagnostic Session

Diagnostics start automatically when gptel module loads on Emacs startup.

You should see these messages:
- ="GPTEL diagnostics auto-enabled - logging to ~/.gptel-diagnostics.log"=
- ="Session diagnostics will write to: <session-dir>/diagnostics.log"=

The diagnostic session captures all bounds changes and parse attempts, writing them:
- To =~/.gptel-diagnostics.log= for non-session buffers (fallback)
- To =<session-dir>/diagnostics.log= when working in a gptel session

** Running the Test Flow

1. Create new session with tool call
2. Inspect bounds: =M-x jf/gptel--inspect-bounds-positions=
3. Show properties: =M-x jf/gptel--show-all-text-properties=
4. Close and reopen buffer
5. Inspect again to compare
6. Send new prompt
7. Generate report: =M-x jf/gptel--dump-diagnostic-report=

** Cleanup

Stop diagnostics: =M-x jf/gptel--stop-diagnostic-session=

* Auto-Initialization

Automatically start the diagnostic session when this module is loaded.
This makes it "hot" immediately without requiring manual activation.

#+begin_src emacs-lisp
;; Auto-start diagnostics when this file is loaded
(jf/gptel--start-diagnostic-session)
(message "GPTEL diagnostics auto-enabled - logging to %s"
         jf/gptel--diagnostic-fallback-file)
(message "Session diagnostics will write to: <session-dir>/diagnostics.log")
#+end_src

* Provide Module

#+begin_src emacs-lisp
(provide 'jf-gptel-diagnostics)
#+end_src
