config/gptel/diagnostics.el

;; Auto-start diagnostics when this file is loaded
(jf/gptel--start-diagnostic-session)
(message "GPTEL diagnostics auto-enabled - logging to %s"
         jf/gptel--diagnostic-fallback-file)
(message "Session diagnostics will write to: <session-dir>/diagnostics.log")

(provide 'jf-gptel-diagnostics)
